export const description = [
    {
        id: 1,
        img: '/src/assets/card1.png',
        alt: '',
        title: 'Прокат велосипедов',
        text: 'Отправьтесь в увлекательное путешествие по лесным тропам и живописным маршрутам на велосипеде. Прокат двухколесного транспорта — отличный способ активно провести время, наслаждаясь свежим воздухом и природными пейзажами.',
        price: 'от 300 / за человека',
    },

    {
        id: 2,
        img: '/src/assets/card2.png',
        alt: '',
        title: 'Баня с чаном',
        text: 'Расслабьтесь и восстановите силы в уютной бане с горячим чаном под открытым небом. Пар, аромат натурального дерева и теплая вода создадут атмосферу полного отдыха, а окружающая природа добавит ощущение гармонии и уединения.',
        price: 'от 3 000 / в сутки',
    },

    {
        id: 3,
        img: '/src/assets/card3.png',
        alt: '',
        title: 'Квадроциклы',
        text: 'Почувствуйте азарт и свободу, отправившись в захватывающую поездку на квадроцикле по лесным тропам. Это отличный способ получить яркие эмоции, исследовать живописные окрестности и насладиться драйвом активного отдыха.',
        price: 'от 1 500 / за человека',
    },

    {
        id: 4,
        img: '/src/assets/card4.png',
        alt: '',
        title: 'Катание на сапах',
        text: 'Исследуйте живописные окрестности с воды, наслаждаясь прогулкой на сапборде по спокойному озеру. Это отличный способ почувствовать единение с природой, расслабиться и провести время с удовольствием, скользя по глади воды под лучами солнца.',
        price: 'от 1 000 / за человека',
    },

    {
        id: 5,
        img: '/src/assets/card5.png',
        alt: '',
        title: 'Звёздные вечера',
        text: 'Откройте для себя красоту ночного неба, наблюдая за звездами и планетами через телескоп. Вдали от городских огней можно увидеть тысячи сияющих созвездий и почувствовать магию бескрайней вселенной.',
        price: 'бесплатно',
    },

];